---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
CloudPoint Members
CloudPoint Structure Constructors Methods Operators Fields See Also Send Feedback
---

The CloudPoint type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
|  | CloudPoint | Creates a new cloud point. |

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Indicates whether this instance and a specified object are equal. (Inherited from ValueType.) |
|  | GetHashCode | Returns the hash code for this instance. (Inherited from ValueType.) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object.) |
|  | ToString | Returns the fully qualified type name of this instance. (Inherited from ValueType.) |

# Operators

|  | Name | Description |
| --- | --- | --- |
|  | ImplicitWideningImplicitImplicitImplicit(CloudPoint to XYZ) | Creates an XYZ object from this point cloud. |

# Fields

|  | Name | Description |
| --- | --- | --- |
|  | Color | The color |
|  | X | The X coordinate |
|  | Y | The Y coordinate |
|  | Z | The Z coordinate |

# See Also

CloudPoint Structure

Autodesk.Revit.DB.PointClouds Namespace